Autodesk.Revit.DB.EntryAndSchemeConsistency
Enumeration used to specify why an entry is inconsistent with a scheme or another entry.
Since:
2022
Since:
2022

Autodesk.Revit.DB.EntryAndSchemeConsistency.InvalidFillPatternId
The fill pattern id is not valid.

Autodesk.Revit.DB.EntryAndSchemeConsistency.ValueDuplicated
There already exists another entry with the same value.

Autodesk.Revit.DB.EntryAndSchemeConsistency.ValueOutOfRange
The value stored in the entry is out of the scheme parameter range.

Autodesk.Revit.DB.EntryAndSchemeConsistency.InconsistentStorageType
The type of value stored in the entry is different from the type of the scheme parameter.

Autodesk.Revit.DB.EntryAndSchemeConsistency.Consistent
The scheme entry can be applied to the scheme.